### Conditional Operations

In [2]:
import string
row_names = list(string.ascii_lowercase)

In [5]:
import pandas as pd
import numpy as np

my_data = np.arange(20, 40).reshape(5, 4)

df = pd.DataFrame(my_data, columns=['var1', 'var2', 'var3', 'var4'],)
df.index = row_names[:len(df.index)]

In [7]:
df[0:2][['var1', 'var2']]

   var1  var2
a    20    21
b    24    25

In [11]:
df[df.var1 > 20]['var1']

b    24
c    28
d    32
e    36
Name: var1, dtype: int32

In [12]:
df[df.var1 > 20]['var2']

b    25
c    29
d    33
e    37
Name: var2, dtype: int32

In [13]:
df[df.var1 > 20]

   var1  var2  var3  var4
b    24    25    26    27
c    28    29    30    31
d    32    33    34    35
e    36    37    38    39

In [14]:
df[(df.var1 > 20) & (df.var3 < 30)]

   var1  var2  var3  var4
b    24    25    26    27

In [17]:
df.loc[(df.var1 > 20),['var1', 'var2']]

   var1  var2
b    24    25
c    28    29
d    32    33
e    36    37